; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	image0 - mode
	infrared3 - mode
	thermograph1 - mode
	thermograph2 - mode
	GroundStation12 - direction
	Star13 - direction
	Star6 - direction
	Star7 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	Star4 - direction
	GroundStation11 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star8 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	Planet14 - direction
	Star15 - direction
	Planet16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 infrared3)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star6)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation10)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument4 thermograph1)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 Star6)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation11)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 infrared3)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation9)
	(calibration_target instrument6 Star8)
	(calibration_target instrument6 GroundStation0)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 image0)
	(supports instrument7 infrared3)
	(calibration_target instrument7 GroundStation10)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(on_board instrument7 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet14)
)
(:goal (and
	(have_image Planet14 infrared3)
	(have_image Star15 thermograph2)
	(have_image Planet16 infrared3)
	(have_image Star17 infrared3)
))

)

; plan
1. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 4
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 4
3. (turn_to satellite0 planet14 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet14)
   goals met: 0 of 4
4. (turn_to satellite0 star6 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star6)
   goals met: 0 of 4
5. (calibrate satellite0 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 0 of 4
6. (turn_to satellite0 planet14 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet14)
   goals met: 0 of 4
7. (take_image satellite0 planet14 instrument1 infrared3)
   added: (have_image planet14 infrared3)
   goals met: 1 of 4
8. (turn_to satellite0 planet16 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet16)
   goals met: 1 of 4
9. (take_image satellite0 planet16 instrument1 infrared3)
   added: (have_image planet16 infrared3)
   goals met: 2 of 4
10. (turn_to satellite0 star15 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star15)
   goals met: 2 of 4
11. (take_image satellite0 star15 instrument1 thermograph2)
   added: (have_image star15 thermograph2)
   goals met: 3 of 4
12. (turn_to satellite0 star17 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star17)
   goals met: 3 of 4
13. (take_image satellite0 star17 instrument1 infrared3)
   added: (have_image star17 infrared3)
   goals met: 4 of 4
